<a href="https://colab.research.google.com/github/Alina-meow/PIS_03_03_21/blob/main/PIS_03_03_2021.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# import packages

In [1]:
import pandas as pd
import numpy as np
from IPython.display import display

# задание Glass Identification

In [3]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [5]:
names = ["Id", "RI", "Na","Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [8]:
data['Class'].replace({1:"building_float",
                       2:"building_non_float",
                       3:"vehicle_float",
                       4:"vehicle_non_float",
                       5:"containers",
                       6:"tableware",
                       7:"headlamps"}, inplace=True)
data['Class'].value_counts()

building_non_float    76
building_float        70
headlamps             29
vehicle_float         17
containers            13
tableware              9
Name: Class, dtype: int64

In [10]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac=fr).index, col] = np.nan

# Data Vizualization

In [12]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      201 non-null    float64
 1   Na      201 non-null    float64
 2   Mg      195 non-null    float64
 3   Al      203 non-null    float64
 4   Si      199 non-null    float64
 5   K       197 non-null    float64
 6   Ca      195 non-null    float64
 7   Ba      197 non-null    float64
 8   Fe      199 non-null    float64
 9   Class   195 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [13]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  201.000000  201.000000  195.000000  ...  195.000000  197.000000  199.000000
mean     1.518359   13.395323    2.653692  ...    8.967846    0.178985    0.058241
std      0.003089    0.822638    1.450788  ...    1.408505    0.504133    0.097925
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516510   12.900000    1.865000  ...    8.235000    0.000000    0.000000
50%      1.517680   13.300000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519150   13.800000    3.605000  ...    9.290000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [17]:
print('-------------------------------------')
display(data['Class'].describe())
print('-------------------------------------')
display(data['Class'].value_counts())

-------------------------------------

count                    195
unique                     6
top       building_non_float
freq                      69
Name: Class, dtype: object

-------------------------------------

building_non_float    69
building_float        62
headlamps             28
vehicle_float         17
containers            11
tableware              8
Name: Class, dtype: int64